[Strings]
app_title=YaToML
col_key=Ключ
col_type=Тип
col_value=Значення
column_label=Стовпець
document_label=Документ
err_cannot_open_file=Не вдалося відкрити файл.
err_cannot_open_for_write=Не вдалося відкрити файл для запису.
err_display_internal=Внутрішня помилка під час відображення файлу:
err_display_unknown=Невідома внутрішня помилка під час відображення файлу.
err_incomplete_write=Не вдалося записати файл повністю.
err_save_aborted_verification=Збереження перервано: перевірка безпеки не пройдена. Файл НЕ був змінений.
err_unexpected_internal=Неочікувана внутрішня помилка: 
err_unknown_parse=Невідома внутрішня помилка під час розбору.
kind_alias=Аліас
kind_bool=Bool
kind_datetime=Дата/час
kind_float=Float
kind_integer=Integer
kind_list=Список
kind_map=Map
kind_null=Null
kind_string=String
line_label=Рядок
menu_collapse_all=Згорнути все
menu_copy_key=Скопіювати ключ
menu_copy_value=Скопіювати значення
menu_edit_value=Редагувати	F2
menu_expand_all=Розгорнути все
menu_navigate=Перейти до вузла дерева
menu_save=Зберегти	Ctrl+S
msg_parse_error_cannot_save=Цей файл містить помилку розбору, зберегти неможливо.
msg_saved_with_hints=Збережено, але із зауваженнями:
parse_error_label=Помилка розбору
preview_alias_prefix=[Аліас -> 
preview_list=[Список]
preview_map=[Map]
save_failed_suffix=Помилка збереження
status_unsaved=Незбережені зміни
verify_structure_child_count=Розбіжність структури після патчу (кількість дочірніх елементів).
verify_structure_doc_count=Розбіжність структури після патчу (кількість документів).
verify_structure_node_type=Розбіжність структури після патчу (тип вузла).
verify_unexpected_change=Нередаговане значення несподівано змінилося.
verify_value_mismatch=Збережене значення не відповідає очікуваному новому значенню.
warn_block_scalar=Багаторядкове блокове значення (|/>) НЕ було збережено (цей випадок поки не підтримується).
warn_could_not_locate=Не вдалося безпечно визначити розташування зміненого значення, його НЕ було збережено.
warn_flow_container=Значення всередині flow-структури ([...]/{...}) НЕ було збережено (цей випадок поки не підтримується).
warn_internal_position_error=Внутрішня помилка позиції для зміненого значення -- НЕ збережено.
warn_invalid_datetime_prefix=Недійсне значення дати «
warn_invalid_datetime_suffix=» НЕ було збережено (збережено початкове значення).
warn_no_position=Змінене значення без відомої позиції НЕ було збережено.
warn_unexpected_value=Неочікуване значення НЕ було збережено (збережено початкове значення).
warn_verify_failed_prefix=Перевірка безпеки не пройдена (
warn_verify_failed_suffix=) -- НІЧОГО не було збережено.
warn_verify_nothing_saved=НІЧОГО не було збережено.
warn_verify_original_unparsable=оригінал неможливо розібрати повторно
warn_verify_unparsable=Перевірка безпеки не пройдена (результат більше не парситься) -- 
